app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM `comments`

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def create
    @comment = Comment.new(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`created_at`, `body`, `nickname`, `updated_at`, `post_id`) VALUES('2010-08-13 06:00:23', NULL, NULL, '2010-08-13 06:00:23', NULL)

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
UPDATE `comments` SET `updated_at` = '2010-08-13 06:04:03', `nickname` = 'Grisha777', `body` = 'Hello guy GRISHA!!!!!!' WHERE `id` = 1

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 1)

  def destroy
    Comments.find(params[:id]).destroy
---
DELETE FROM `comments` WHERE `id` = 4
SELECT * FROM `comments` WHERE (`comments`.`id` = 4)